app/controllers/cats_controller.rb

    def index
        @kitties = Cat.all
---
SELECT "cats".* FROM "cats"

    def show
        @kitty = Cat.find_by(id: params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        @kitty = Cat.new(cat_params)

        if @kitty.save
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def update
         @kitty = Cat.find_by(id: params[:id])

        if @kitty.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "cats" SET "birth_date" = $1, "color" = $2, "description" = $3, "name" = $4, "sex" = $5, "updated_at" = $6 WHERE "cats"."id" = $7  [["birth_date", "2019-06-11"], ["color", "brown"], ["description", "WHY WILL YOU NOT UPDATE?!?!?!?!"], ["name", "HELLO"], ["sex", "F"], ["updated_at", "2019-06-19 23:21:15.173575"], ["id", 3]]

    def edit
        @kitty = Cat.find_by(id: params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]